<a href="https://colab.research.google.com/github/profliuhao/CSIT355/blob/main/CSIT_355_Week_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Demo

## Part 1

[IMPORTANT] Load the sql extension , so that you could start using the %%sql to indicate sql operations.

In [ ]:
%load_ext sql

You could create an empty SQLite DB using the following command.

In [ ]:
%%sql
sqlite:///test.db

Now we can create a table called "sample"

In [ ]:
%%sql
create table sample(column_1 int, column_2 varchar);

 * sqlite:///test.db
Done.

[]

This step is optional since it will delete existing rows in the table "sample".

In [ ]:
%%sql
DELETE FROM sample;

 * sqlite:///test.db
0 rows affected.

[]

Let's insert two records into the table "sample"

In [ ]:
%%sql
insert into sample values (1,'Jack'),(2,'Emily');

 * sqlite:///test.db
2 rows affected.

[]

In [ ]:
%%sql
select * from sample;

 * sqlite:///test.db
Done.

[(1, 'Jack'), (2, 'Emily')]

To delete a table, we can use drop table [table name];
"if exists" check if the table to be deleted exists or not

In [ ]:
%%sql
drop table sample;
# drop table if exists sample;

 * sqlite:///test.db
Done.
(sqlite3.OperationalError) unrecognized token: "#"
[SQL: # drop table if exists sample;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Error if we run the "select" operation after delete the table

In [ ]:
%%sql
select * from sample;

 * sqlite:///test.db
(sqlite3.OperationalError) no such table: sample
[SQL: select * from sample;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## Part 2

In [ ]:
%%sql
drop table if exists Employee;
drop table if exists Department;
drop table if exists Works;

 * sqlite:///test.db
Done.
Done.
Done.

[]

In [ ]:
%%sql
create table Employee(eid int, ename varchar(20), age int, salary number(8,2), PRIMARY KEY (eid));

create table Department(did int, dname varchar, budget number(8,2), managerid int, PRIMARY KEY (did));

create table Works(eid int, did int, pct_time int, PRIMARY KEY (eid, did));

 * sqlite:///test.db
Done.
Done.
Done.

[]

In [ ]:
%%sql
DELETE FROM Employee;
DELETE FROM Works;
DELETE FROM Department;
insert into Employee values ( 101,'Andrew Fuller', 40, 50000);
insert into Employee values ( 102, 'Justin Peacock', 25, 20000);
insert into Employee values ( 103, 'Nancy Buchanan', 35, 30000);
insert into Employee values ( 104, 'Robert King', 30, 20000);

insert into Department values (1001, 'IT', 500000, 101);
insert into Department values (1002, 'Computing', 750000, 110);
insert into Department values (1003, 'Finance', 350000, 103);

insert into Works values (101, 1001, 100);
insert into Works values (102, 1001, 20);
insert into Works values (102, 1002, 50);
insert into Works values (102, 1003, 10);
insert into Works values (103, 1003, 90);
insert into Works values (103, 1001, 10);
insert into Works values (104, 1001, 20);
insert into Works values (104, 1002, 70);

 * sqlite:///test.db
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
select * from Employee;

 * sqlite:///test.db
Done.

[(101, 'Andrew Fuller', 40, 50000),
 (102, 'Justin Peacock', 25, 20000),
 (103, 'Nancy Buchanan', 35, 30000),
 (104, 'Robert King', 30, 20000)]

In [ ]:
%sql PRAGMA table_info([Employee]);

 * sqlite:///test.db
Done.

[(0, 'eid', 'INT', 0, None, 1),
 (1, 'ename', 'varchar(20)', 0, None, 0),
 (2, 'age', 'INT', 0, None, 0),
 (3, 'salary', 'number(8,2)', 0, None, 0)]

In [ ]:
%sql PRAGMA table_info([Department]);

 * sqlite:///test.db
Done.

[(0, 'did', 'INT', 0, None, 1),
 (1, 'dname', 'varchar', 0, None, 0),
 (2, 'budget', 'number(8,2)', 0, None, 0),
 (3, 'managerid', 'INT', 0, None, 0)]

In [ ]:
%sql PRAGMA table_info([Works]);

 * sqlite:///test.db
Done.

[(0, 'eid', 'INT', 0, None, 1),
 (1, 'did', 'INT', 0, None, 2),
 (2, 'pct_time', 'INT', 0, None, 0)]